Revit 2027 API
ControlledApplication.CurrentUsersDataFolderPath Property
 Path to data folder for the current user.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string CurrentUsersDataFolderPath { get; }
Public ReadOnly Property CurrentUsersDataFolderPath As String
	Get
public:
property String^ CurrentUsersDataFolderPath {
	String^ get ();
}
member CurrentUsersDataFolderPath : string with get
Property Value
String
Remarks
 Similar to C:\Users\[UserName]\AppData\Roaming\Autodesk\[ProductType]\[ReleaseName]
See Also
Reference
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace